qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405kx.h
/****************  Bit definition for FLASH_QSPIKEY1 register  ****************/
#define FLASH_QSPIKEY1_QSPIKEY1_Pos         (16U)
#define FLASH_QSPIKEY1_QSPIKEY1_Msk         (0xFFU << FLASH_QSPIKEY1_QSPIKEY1_Pos)  /*!< 0x00FF0000 */
#define FLASH_QSPIKEY1_QSPIKEY1             FLASH_QSPIKEY1_QSPIKEY1_Msk             /*!< QSPI ciphertext access area encryption key byte 1 */
#define FLASH_QSPIKEY1_nQSPIKEY1_Pos        (23U)
#define FLASH_QSPIKEY1_nQSPIKEY1_Msk        (0xFFU << FLASH_QSPIKEY1_nQSPIKEY1_Pos) /*!< 0xFF000000 */
#define FLASH_QSPIKEY1_nQSPIKEY1            FLASH_QSPIKEY1_nQSPIKEY1_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 1 */

/****************  Bit definition for FLASH_QSPIKEY2 register  ****************/
#define FLASH_QSPIKEY2_QSPIKEY2_Pos         (0U)
#define FLASH_QSPIKEY2_QSPIKEY2_Msk         (0xFFU << FLASH_QSPIKEY2_QSPIKEY2_Pos)  /*!< 0x000000FF */
#define FLASH_QSPIKEY2_QSPIKEY2             FLASH_QSPIKEY2_QSPIKEY2_Msk             /*!< QSPI ciphertext access area encryption key byte 2 */
#define FLASH_QSPIKEY2_nQSPIKEY2_Pos        (8U)
#define FLASH_QSPIKEY2_nQSPIKEY2_Msk        (0xFFU << FLASH_QSPIKEY2_nQSPIKEY2_Pos) /*!< 0x0000FF00 */
#define FLASH_QSPIKEY2_nQSPIKEY2            FLASH_QSPIKEY2_nQSPIKEY2_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 2 */

/****************  Bit definition for FLASH_QSPIKEY3 register  ****************/
#define FLASH_QSPIKEY3_QSPIKEY3_Pos         (16U)
#define FLASH_QSPIKEY3_QSPIKEY3_Msk         (0xFFU << FLASH_QSPIKEY3_QSPIKEY3_Pos)  /*!< 0x00FF0000 */
#define FLASH_QSPIKEY3_QSPIKEY3             FLASH_QSPIKEY3_QSPIKEY3_Msk             /*!< QSPI ciphertext access area encryption key byte 3 */
#define FLASH_QSPIKEY3_nQSPIKEY3_Pos        (23U)
#define FLASH_QSPIKEY3_nQSPIKEY3_Msk        (0xFFU << FLASH_QSPIKEY3_nQSPIKEY3_Pos) /*!< 0xFF000000 */
#define FLASH_QSPIKEY3_nQSPIKEY3            FLASH_QSPIKEY3_nQSPIKEY3_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 3 */

/*****************  Bit definition for FLASH_DATA2 register  ******************/
#define FLASH_DATA2_DATA2_Pos               (0U)
#define FLASH_DATA2_DATA2_Msk               (0xFFU << FLASH_DATA2_DATA2_Pos)        /*!< 0x000000FF */
#define FLASH_DATA2_DATA2                   FLASH_DATA2_DATA2_Msk                   /*!< User data 2 */
#define FLASH_DATA2_nDATA2_Pos              (8U)
#define FLASH_DATA2_nDATA2_Msk              (0xFFU << FLASH_DATA2_nDATA2_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA2_nDATA2                  FLASH_DATA2_nDATA2_Msk                  /*!< Inverse code of user data 2 */

/*****************  Bit definition for FLASH_DATA3 register  ******************/
#define FLASH_DATA3_DATA3_Pos               (16U)
#define FLASH_DATA3_DATA3_Msk               (0xFFU << FLASH_DATA3_DATA3_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA3_DATA3                   FLASH_DATA3_DATA3_Msk                   /*!< User data 3 */
#define FLASH_DATA3_nDATA3_Pos              (24U)
#define FLASH_DATA3_nDATA3_Msk              (0xFFU << FLASH_DATA3_nDATA3_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA3_nDATA3                  FLASH_DATA3_nDATA3_Msk                  /*!< Inverse code of user data 3 */

/*****************  Bit definition for FLASH_DATA4 register  ******************/
#define FLASH_DATA4_DATA4_Pos               (0U)
#define FLASH_DATA4_DATA4_Msk               (0xFFU << FLASH_DATA4_DATA4_Pos)        /*!< 0x000000FF */
#define FLASH_DATA4_DATA4                   FLASH_DATA4_DATA4_Msk                   /*!< User data 4 */
#define FLASH_DATA4_nDATA4_Pos              (8U)
#define FLASH_DATA4_nDATA4_Msk              (0xFFU << FLASH_DATA4_nDATA4_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA4_nDATA4                  FLASH_DATA4_nDATA4_Msk                  /*!< Inverse code of user data 4 */

/*****************  Bit definition for FLASH_DATA5 register  ******************/
#define FLASH_DATA5_DATA5_Pos               (16U)
#define FLASH_DATA5_DATA5_Msk               (0xFFU << FLASH_DATA5_DATA5_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA5_DATA5                   FLASH_DATA5_DATA5_Msk                   /*!< User data 5 */
#define FLASH_DATA5_nDATA5_Pos              (24U)
#define FLASH_DATA5_nDATA5_Msk              (0xFFU << FLASH_DATA5_nDATA5_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA5_nDATA5                  FLASH_DATA5_nDATA5_Msk                  /*!< Inverse code of user data 5 */

/*****************  Bit definition for FLASH_DATA6 register  ******************/
#define FLASH_DATA6_DATA6_Pos               (0U)
#define FLASH_DATA6_DATA6_Msk               (0xFFU << FLASH_DATA6_DATA6_Pos)        /*!< 0x000000FF */
#define FLASH_DATA6_DATA6                   FLASH_DATA6_DATA6_Msk                   /*!< User data 6 */
#define FLASH_DATA6_nDATA6_Pos              (8U)
#define FLASH_DATA6_nDATA6_Msk              (0xFFU << FLASH_DATA6_nDATA6_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA6_nDATA6                  FLASH_DATA6_nDATA6_Msk                  /*!< Inverse code of user data 6 */

/*****************  Bit definition for FLASH_DATA7 register  ******************/
#define FLASH_DATA7_DATA7_Pos               (16U)
#define FLASH_DATA7_DATA7_Msk               (0xFFU << FLASH_DATA7_DATA7_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA7_DATA7                   FLASH_DATA7_DATA7_Msk                   /*!< User data 7 */
#define FLASH_DATA7_nDATA7_Pos              (24U)
#define FLASH_DATA7_nDATA7_Msk              (0xFFU << FLASH_DATA7_nDATA7_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA7_nDATA7                  FLASH_DATA7_nDATA7_Msk                  /*!< Inverse code of user data 7 */

/*!< Noted: The FLASH_DATA go up to 219, it too long for added in here */

/******************************************************************************/
/*                                                                            */
/*       General-purpose I/Os (GPIO) & Multiplex function I/Os (IOMUX)        */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for GPIO_CFGR register  *******************/
#define GPIO_CFGR_IOMC_Pos                  (0U)
#define GPIO_CFGR_IOMC_Msk                  (0xFFFFFFFFU << GPIO_CFGR_IOMC_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_CFGR_IOMC                      GPIO_CFGR_IOMC_Msk                      /*!< GPIO x mode configuration */

/*!< IOMC0 configuration */
#define GPIO_CFGR_IOMC0_Pos                 (0U)
#define GPIO_CFGR_IOMC0_Msk                 (0x3U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000003 */
#define GPIO_CFGR_IOMC0                     GPIO_CFGR_IOMC0_Msk                     /*!< IOMC0[1:0] bits (GPIO x mode configuration, pin 0) */
#define GPIO_CFGR_IOMC0_0                   (0x1U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000001 */
#define GPIO_CFGR_IOMC0_1                   (0x2U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000002 */

