qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405kx.h
/*******************  Bit definition for I2C_RXDT register  *******************/
#define I2C_RXDT_DT_Pos                     (0U)
#define I2C_RXDT_DT_Msk                     (0xFFU << I2C_RXDT_DT_Pos)              /*!< 0x000000FF */
#define I2C_RXDT_DT                         I2C_RXDT_DT_Msk                         /*!< Receive data register */

/*******************  Bit definition for I2C_TXDT register  *******************/
#define I2C_TXDT_DT_Pos                     (0U)
#define I2C_TXDT_DT_Msk                     (0xFFU << I2C_TXDT_DT_Pos)              /*!< 0x000000FF */
#define I2C_TXDT_DT                         I2C_TXDT_DT_Msk                         /*!< Transmit data register */

/******************************************************************************/
/*                                                                            */
/*      Universal synchronous/asynchronous receiver/transmitter (USART)       */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for USART_STS register  *******************/
#define USART_STS_PERR_Pos                  (0U)
#define USART_STS_PERR_Msk                  (0x1U << USART_STS_PERR_Pos)            /*!< 0x00000001 */
#define USART_STS_PERR                      USART_STS_PERR_Msk                      /*!< Parity error */
#define USART_STS_FERR_Pos                  (1U)
#define USART_STS_FERR_Msk                  (0x1U << USART_STS_FERR_Pos)            /*!< 0x00000002 */
#define USART_STS_FERR                      USART_STS_FERR_Msk                      /*!< Framing error */
#define USART_STS_NERR_Pos                  (2U)
#define USART_STS_NERR_Msk                  (0x1U << USART_STS_NERR_Pos)            /*!< 0x00000004 */
#define USART_STS_NERR                      USART_STS_NERR_Msk                      /*!< Noise error */
#define USART_STS_ROERR_Pos                 (3U)
#define USART_STS_ROERR_Msk                 (0x1U << USART_STS_ROERR_Pos)           /*!< 0x00000008 */
#define USART_STS_ROERR                     USART_STS_ROERR_Msk                     /*!< Receiver overflow error */
#define USART_STS_IDLEF_Pos                 (4U)
#define USART_STS_IDLEF_Msk                 (0x1U << USART_STS_IDLEF_Pos)           /*!< 0x00000010 */
#define USART_STS_IDLEF                     USART_STS_IDLEF_Msk                     /*!< Idle flag */
#define USART_STS_RDBF_Pos                  (5U)
#define USART_STS_RDBF_Msk                  (0x1U << USART_STS_RDBF_Pos)            /*!< 0x00000020 */
#define USART_STS_RDBF                      USART_STS_RDBF_Msk                      /*!< Receive data buffer full */
#define USART_STS_TDC_Pos                   (6U)
#define USART_STS_TDC_Msk                   (0x1U << USART_STS_TDC_Pos)             /*!< 0x00000040 */
#define USART_STS_TDC                       USART_STS_TDC_Msk                       /*!< Transmit data complete */
#define USART_STS_TDBE_Pos                  (7U)
#define USART_STS_TDBE_Msk                  (0x1U << USART_STS_TDBE_Pos)            /*!< 0x00000080 */
#define USART_STS_TDBE                      USART_STS_TDBE_Msk                      /*!< Transmit data buffer empty */
#define USART_STS_BFF_Pos                   (8U)
#define USART_STS_BFF_Msk                   (0x1U << USART_STS_BFF_Pos)             /*!< 0x00000100 */
#define USART_STS_BFF                       USART_STS_BFF_Msk                       /*!< Break frame flag */
#define USART_STS_CTSCF_Pos                 (9U)
#define USART_STS_CTSCF_Msk                 (0x1U << USART_STS_CTSCF_Pos)           /*!< 0x00000200 */
#define USART_STS_CTSCF                     USART_STS_CTSCF_Msk                     /*!< CTS change flag */
#define USART_STS_RTODF_Pos                 (11U)
#define USART_STS_RTODF_Msk                 (0x1U << USART_STS_RTODF_Pos)           /*!< 0x00000800 */
#define USART_STS_RTODF                     USART_STS_RTODF_Msk                     /*!< Receiver timeout detection flag */
#define USART_STS_CMDF_Pos                  (17U)
#define USART_STS_CMDF_Msk                  (0x1U << USART_STS_CMDF_Pos)            /*!< 0x00020000 */
#define USART_STS_CMDF                      USART_STS_CMDF_Msk                      /*!< Byte match detection flag */

/*******************  Bit definition for USART_DT register  *******************/
#define USART_DT_DT_Pos                     (0U)
#define USART_DT_DT_Msk                     (0x1FFU << USART_DT_DT_Pos)             /*!< 0x000001FF */
#define USART_DT_DT                         USART_DT_DT_Msk                         /*!< Data value */

/*****************  Bit definition for USART_BAUDR register  ******************/
#define USART_BAUDR_DIV_Pos                 (0U)
#define USART_BAUDR_DIV_Msk                 (0xFFFFU << USART_BAUDR_DIV_Pos)        /*!< 0x0000FFFF */
#define USART_BAUDR_DIV                     USART_BAUDR_DIV_Msk                     /*!< Divider */

/*****************  Bit definition for USART_CTRL1 register  ******************/
#define USART_CTRL1_SBF_Pos                 (0U)
#define USART_CTRL1_SBF_Msk                 (0x1U << USART_CTRL1_SBF_Pos)           /*!< 0x00000001 */
#define USART_CTRL1_SBF                     USART_CTRL1_SBF_Msk                     /*!< Send break frame */
#define USART_CTRL1_RM_Pos                  (1U)
#define USART_CTRL1_RM_Msk                  (0x1U << USART_CTRL1_RM_Pos)            /*!< 0x00000002 */
#define USART_CTRL1_RM                      USART_CTRL1_RM_Msk                      /*!< Receiver mute */
#define USART_CTRL1_REN_Pos                 (2U)
#define USART_CTRL1_REN_Msk                 (0x1U << USART_CTRL1_REN_Pos)           /*!< 0x00000004 */
#define USART_CTRL1_REN                     USART_CTRL1_REN_Msk                     /*!< Receiver enable */
#define USART_CTRL1_TEN_Pos                 (3U)
#define USART_CTRL1_TEN_Msk                 (0x1U << USART_CTRL1_TEN_Pos)           /*!< 0x00000008 */
#define USART_CTRL1_TEN                     USART_CTRL1_TEN_Msk                     /*!< Transmitter enable */
#define USART_CTRL1_IDLEIEN_Pos             (4U)
#define USART_CTRL1_IDLEIEN_Msk             (0x1U << USART_CTRL1_IDLEIEN_Pos)       /*!< 0x00000010 */
#define USART_CTRL1_IDLEIEN                 USART_CTRL1_IDLEIEN_Msk                 /*!< IDLE interrupt enable */
#define USART_CTRL1_RDBFIEN_Pos             (5U)
#define USART_CTRL1_RDBFIEN_Msk             (0x1U << USART_CTRL1_RDBFIEN_Pos)       /*!< 0x00000020 */
#define USART_CTRL1_RDBFIEN                 USART_CTRL1_RDBFIEN_Msk                 /*!< RDBF interrupt enable */
#define USART_CTRL1_TDCIEN_Pos              (6U)
#define USART_CTRL1_TDCIEN_Msk              (0x1U << USART_CTRL1_TDCIEN_Pos)        /*!< 0x00000040 */
#define USART_CTRL1_TDCIEN                  USART_CTRL1_TDCIEN_Msk                  /*!< TDC interrupt enable */
#define USART_CTRL1_TDBEIEN_Pos             (7U)
#define USART_CTRL1_TDBEIEN_Msk             (0x1U << USART_CTRL1_TDBEIEN_Pos)       /*!< 0x00000080 */
#define USART_CTRL1_TDBEIEN                 USART_CTRL1_TDBEIEN_Msk                 /*!< TDBE interrupt enable */
#define USART_CTRL1_PERRIEN_Pos             (8U)
#define USART_CTRL1_PERRIEN_Msk             (0x1U << USART_CTRL1_PERRIEN_Pos)       /*!< 0x00000100 */
#define USART_CTRL1_PERRIEN                 USART_CTRL1_PERRIEN_Msk                 /*!< PERR interrupt enable */
#define USART_CTRL1_PSEL_Pos                (9U)
#define USART_CTRL1_PSEL_Msk                (0x1U << USART_CTRL1_PSEL_Pos)          /*!< 0x00000200 */
#define USART_CTRL1_PSEL                    USART_CTRL1_PSEL_Msk                    /*!< Parity selection */
#define USART_CTRL1_PEN_Pos                 (10U)
#define USART_CTRL1_PEN_Msk                 (0x1U << USART_CTRL1_PEN_Pos)           /*!< 0x00000400 */
#define USART_CTRL1_PEN                     USART_CTRL1_PEN_Msk                     /*!< Parity enable */
#define USART_CTRL1_WUM_Pos                 (11U)
#define USART_CTRL1_WUM_Msk                 (0x1U << USART_CTRL1_WUM_Pos)           /*!< 0x00000800 */
#define USART_CTRL1_WUM                     USART_CTRL1_WUM_Msk                     /*!< Wakeup mode */
#define USART_CTRL1_DBN0_Pos                (12U)
#define USART_CTRL1_DBN0_Msk                (0x1U << USART_CTRL1_DBN0_Pos)          /*!< 0x00001000 */
#define USART_CTRL1_DBN0                    USART_CTRL1_DBN0_Msk                    /*!< Data bit num 0 */
#define USART_CTRL1_UEN_Pos                 (13U)
#define USART_CTRL1_UEN_Msk                 (0x1U << USART_CTRL1_UEN_Pos)           /*!< 0x00002000 */
#define USART_CTRL1_UEN                     USART_CTRL1_UEN_Msk                     /*!< USART enable */
#define USART_CTRL1_CMDIE_Pos               (14U)
#define USART_CTRL1_CMDIE_Msk               (0x1U << USART_CTRL1_CMDIE_Pos)         /*!< 0x00004000 */
#define USART_CTRL1_CMDIE                   USART_CTRL1_CMDIE_Msk                   /*!< Character match detection interrupt enable */
#define USART_CTRL1_TCDT_Pos                (16U)
#define USART_CTRL1_TCDT_Msk                (0x1FU << USART_CTRL1_TCDT_Pos)         /*!< 0x001F0000 */
#define USART_CTRL1_TCDT                    USART_CTRL1_TCDT_Msk                    /*!< Transmit complete delay time */
#define USART_CTRL1_TSDT_Pos                (21U)
#define USART_CTRL1_TSDT_Msk                (0x1FU << USART_CTRL1_TSDT_Pos)         /*!< 0x03E00000 */
#define USART_CTRL1_TSDT                    USART_CTRL1_TSDT_Msk                    /*!< Transmit start delay time */
#define USART_CTRL1_RETODIE_Pos             (26U)
#define USART_CTRL1_RETODIE_Msk             (0x1U << USART_CTRL1_RETODIE_Pos)       /*!< 0x04000000 */
#define USART_CTRL1_RETODIE                 USART_CTRL1_RETODIE_Msk                 /*!< Receiver timeout detection interrupt enable */
#define USART_CTRL1_RTODEN_Pos              (27U)
#define USART_CTRL1_RTODEN_Msk              (0x1U << USART_CTRL1_RTODEN_Pos)        /*!< 0x08000000 */
#define USART_CTRL1_RTODEN                  USART_CTRL1_RTODEN_Msk                  /*!< Receiver timeout detection enable */
#define USART_CTRL1_DBN1_Pos                (28U)
#define USART_CTRL1_DBN1_Msk                (0x1U << USART_CTRL1_DBN1_Pos)          /*!< 0x10000000 */
#define USART_CTRL1_DBN1                    USART_CTRL1_DBN1_Msk                    /*!< Data bit num 1 */

/*****************  Bit definition for USART_CTRL2 register  ******************/
#define USART_CTRL2_IDL_Pos                 (0U)
#define USART_CTRL2_IDL_Msk                 (0xFU << USART_CTRL2_IDL_Pos)           /*!< 0x0000000F */
#define USART_CTRL2_IDL                     USART_CTRL2_IDL_Msk                     /*!< USART identification low */
#define USART_CTRL2_IDBN_Pos                (4U)
#define USART_CTRL2_IDBN_Msk                (0x1U << USART_CTRL2_IDBN_Pos)          /*!< 0x00000010 */
#define USART_CTRL2_IDBN                    USART_CTRL2_IDBN_Msk                    /*!< Identification bit number */
#define USART_CTRL2_BFBN_Pos                (5U)
#define USART_CTRL2_BFBN_Msk                (0x1U << USART_CTRL2_BFBN_Pos)          /*!< 0x00000020 */
#define USART_CTRL2_BFBN                    USART_CTRL2_BFBN_Msk                    /*!< Break frame bit num */
#define USART_CTRL2_BFIEN_Pos               (6U)
#define USART_CTRL2_BFIEN_Msk               (0x1U << USART_CTRL2_BFIEN_Pos)         /*!< 0x00000040 */
#define USART_CTRL2_BFIEN                   USART_CTRL2_BFIEN_Msk                   /*!< Break frame interrupt enable */
#define USART_CTRL2_LBCP_Pos                (8U)
#define USART_CTRL2_LBCP_Msk                (0x1U << USART_CTRL2_LBCP_Pos)          /*!< 0x00000100 */
#define USART_CTRL2_LBCP                    USART_CTRL2_LBCP_Msk                    /*!< Last bit clock pulse */
#define USART_CTRL2_CLKPHA_Pos              (9U)
#define USART_CTRL2_CLKPHA_Msk              (0x1U << USART_CTRL2_CLKPHA_Pos)        /*!< 0x00000200 */
#define USART_CTRL2_CLKPHA                  USART_CTRL2_CLKPHA_Msk                  /*!< Clock phase */
#define USART_CTRL2_CLKPOL_Pos              (10U)
#define USART_CTRL2_CLKPOL_Msk              (0x1U << USART_CTRL2_CLKPOL_Pos)        /*!< 0x00000400 */
#define USART_CTRL2_CLKPOL                  USART_CTRL2_CLKPOL_Msk                  /*!< Clock polarity */
#define USART_CTRL2_CLKEN_Pos               (11U)
#define USART_CTRL2_CLKEN_Msk               (0x1U << USART_CTRL2_CLKEN_Pos)         /*!< 0x00000800 */
#define USART_CTRL2_CLKEN                   USART_CTRL2_CLKEN_Msk                   /*!< Clock enable */

/*!< STOPBN configuration */
#define USART_CTRL2_STOPBN_Pos              (12U)
#define USART_CTRL2_STOPBN_Msk              (0x3U << USART_CTRL2_STOPBN_Pos)        /*!< 0x00003000 */
#define USART_CTRL2_STOPBN                  USART_CTRL2_STOPBN_Msk                  /*!< STOPBN[1:0] bits (STOP bit num) */
#define USART_CTRL2_STOPBN_0                (0x1U << USART_CTRL2_STOPBN_Pos)        /*!< 0x00001000 */
#define USART_CTRL2_STOPBN_1                (0x2U << USART_CTRL2_STOPBN_Pos)        /*!< 0x00002000 */

