qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405kx.h
/*******************  Bit definition for SPI_TCRC register  *******************/
#define SPI_TCRC_TCRC_Pos                   (0U)
#define SPI_TCRC_TCRC_Msk                   (0xFFFFU << SPI_TCRC_TCRC_Pos)          /*!< 0x0000FFFF */
#define SPI_TCRC_TCRC                       SPI_TCRC_TCRC_Msk                       /*!< Transmit CRC */

/*****************  Bit definition for SPI_I2SCTRL register  ******************/
#define SPI_I2SCTRL_I2SCBN_Pos              (0U)
#define SPI_I2SCTRL_I2SCBN_Msk              (0x1U << SPI_I2SCTRL_I2SCBN_Pos)        /*!< 0x00000001 */
#define SPI_I2SCTRL_I2SCBN                  SPI_I2SCTRL_I2SCBN_Msk                  /*!< Channel length (I2S channel bit num) */

/*!< I2SDBN configuration */
#define SPI_I2SCTRL_I2SDBN_Pos              (1U)
#define SPI_I2SCTRL_I2SDBN_Msk              (0x3U << SPI_I2SCTRL_I2SDBN_Pos)        /*!< 0x00000006 */
#define SPI_I2SCTRL_I2SDBN                  SPI_I2SCTRL_I2SDBN_Msk                  /*!< I2SDBN[1:0] bits (I2S data bit num) */
#define SPI_I2SCTRL_I2SDBN_0                (0x1U << SPI_I2SCTRL_I2SDBN_Pos)        /*!< 0x00000002 */
#define SPI_I2SCTRL_I2SDBN_1                (0x2U << SPI_I2SCTRL_I2SDBN_Pos)        /*!< 0x00000004 */

#define SPI_I2SCTRL_I2SCLKPOL_Pos           (3U)
#define SPI_I2SCTRL_I2SCLKPOL_Msk           (0x1U << SPI_I2SCTRL_I2SCLKPOL_Pos)     /*!< 0x00000008 */
#define SPI_I2SCTRL_I2SCLKPOL               SPI_I2SCTRL_I2SCLKPOL_Msk               /*!< I2S clock polarity */

/*!< STDSEL configuration */
#define SPI_I2SCTRL_STDSEL_Pos              (4U)
#define SPI_I2SCTRL_STDSEL_Msk              (0x3U << SPI_I2SCTRL_STDSEL_Pos)        /*!< 0x00000030 */
#define SPI_I2SCTRL_STDSEL                  SPI_I2SCTRL_STDSEL_Msk                  /*!< STDSEL[1:0] bits (I2S standard select) */
#define SPI_I2SCTRL_STDSEL_0                (0x1U << SPI_I2SCTRL_STDSEL_Pos)        /*!< 0x00000010 */
#define SPI_I2SCTRL_STDSEL_1                (0x2U << SPI_I2SCTRL_STDSEL_Pos)        /*!< 0x00000020 */

#define SPI_I2SCTRL_PCMFSSEL_Pos            (7U)
#define SPI_I2SCTRL_PCMFSSEL_Msk            (0x1U << SPI_I2SCTRL_PCMFSSEL_Pos)      /*!< 0x00000080 */
#define SPI_I2SCTRL_PCMFSSEL                SPI_I2SCTRL_PCMFSSEL_Msk                /*!< PCM frame synchronization */

/*!< OPERSEL configuration */
#define SPI_I2SCTRL_OPERSEL_Pos             (8U)
#define SPI_I2SCTRL_OPERSEL_Msk             (0x3U << SPI_I2SCTRL_OPERSEL_Pos)       /*!< 0x00000300 */
#define SPI_I2SCTRL_OPERSEL                 SPI_I2SCTRL_OPERSEL_Msk                 /*!< OPERSEL[1:0] bits (I2S operation mode select) */
#define SPI_I2SCTRL_OPERSEL_0               (0x1U << SPI_I2SCTRL_OPERSEL_Pos)       /*!< 0x00000100 */
#define SPI_I2SCTRL_OPERSEL_1               (0x2U << SPI_I2SCTRL_OPERSEL_Pos)       /*!< 0x00000200 */

#define SPI_I2SCTRL_I2SEN_Pos               (10U)
#define SPI_I2SCTRL_I2SEN_Msk               (0x1U << SPI_I2SCTRL_I2SEN_Pos)         /*!< 0x00000400 */
#define SPI_I2SCTRL_I2SEN                   SPI_I2SCTRL_I2SEN_Msk                   /*!< I2S enable */
#define SPI_I2SCTRL_I2SMSEL_Pos             (11U)
#define SPI_I2SCTRL_I2SMSEL_Msk             (0x1U << SPI_I2SCTRL_I2SMSEL_Pos)       /*!< 0x00000800 */
#define SPI_I2SCTRL_I2SMSEL                 SPI_I2SCTRL_I2SMSEL_Msk                 /*!< I2S mode select */
#define SPI_I2SCTRL_I2SFDUPEN_Pos           (13U)
#define SPI_I2SCTRL_I2SFDUPEN_Msk           (0x1U << SPI_I2SCTRL_I2SFDUPEN_Pos)     /*!< 0x00002000 */
#define SPI_I2SCTRL_I2SFDUPEN               SPI_I2SCTRL_I2SFDUPEN_Msk               /*!< I2S full duplex enable */

/*****************  Bit definition for SPI_I2SCLKP register  ******************/
#define SPI_I2SCLKP_I2SDIV_Msk              ((0xFFU << 0) | (0x3U << 10))           /*!< 0x00000CFF */
#define SPI_I2SCLKP_I2SDIV                  SPI_I2SCLKP_I2SDIV_Msk                  /*!< I2SDIV[9:0] bits (I2S division) */
#define SPI_I2SCLKP_I2SODD_Pos              (8U)
#define SPI_I2SCLKP_I2SODD_Msk              (0x1U << SPI_I2SCLKP_I2SODD_Pos)        /*!< 0x00000100 */
#define SPI_I2SCLKP_I2SODD                  SPI_I2SCLKP_I2SODD_Msk                  /*!< Odd factor for I2S division */
#define SPI_I2SCLKP_I2SMCLKOE_Pos           (9U)
#define SPI_I2SCLKP_I2SMCLKOE_Msk           (0x1U << SPI_I2SCLKP_I2SMCLKOE_Pos)     /*!< 0x00000200 */
#define SPI_I2SCLKP_I2SMCLKOE               SPI_I2SCLKP_I2SMCLKOE_Msk               /*!< I2S Master clock output enable */

/******************  Bit definition for SPI_MISC1 register  *******************/
#define SPI_MISC1_I2SFPCMCKSEL_Pos          (0U)
#define SPI_MISC1_I2SFPCMCKSEL_Msk          (0x1U << SPI_MISC1_I2SFPCMCKSEL_Pos)    /*!< 0x00000001 */
#define SPI_MISC1_I2SFPCMCKSEL              SPI_MISC1_I2SFPCMCKSEL_Msk              /*!< I2S PCM clock edge select */

/******************************************************************************/
/*                                                                            */
/*                        Window watchdog timer (WWDT)                        */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for WWDT_CTRL register  *******************/
/*!< CNT configuration */
#define WWDT_CTRL_CNT_Pos                   (0U)
#define WWDT_CTRL_CNT_Msk                   (0x7FU << WWDT_CTRL_CNT_Pos)            /*!< 0x0000007F */
#define WWDT_CTRL_CNT                       WWDT_CTRL_CNT_Msk                       /*!< CNT[6:0] bits (Down counter) */
#define WWDT_CTRL_CNT_0                     (0x01U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000001 */
#define WWDT_CTRL_CNT_1                     (0x02U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000002 */
#define WWDT_CTRL_CNT_2                     (0x04U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000004 */
#define WWDT_CTRL_CNT_3                     (0x08U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000008 */
#define WWDT_CTRL_CNT_4                     (0x10U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000010 */
#define WWDT_CTRL_CNT_5                     (0x20U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000020 */
#define WWDT_CTRL_CNT_6                     (0x40U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000040 */

