qmk-arterytek/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F405/at32f405kx.h
/*******************  Bit definition for CAN_RFC1 register  *******************/
#define CAN_RFC1_RFDTL_Pos                  (0U)
#define CAN_RFC1_RFDTL_Msk                  (0xFU << CAN_RFC1_RFDTL_Pos)            /*!< 0x0000000F */
#define CAN_RFC1_RFDTL                      CAN_RFC1_RFDTL_Msk                      /*!< Receive FIFO data length */
#define CAN_RFC1_RFFMN_Pos                  (8U)
#define CAN_RFC1_RFFMN_Msk                  (0xFFU << CAN_RFC1_RFFMN_Pos)           /*!< 0x0000FF00 */
#define CAN_RFC1_RFFMN                      CAN_RFC1_RFFMN_Msk                      /*!< Receive FIFO filter match number */
#define CAN_RFC1_RFTS_Pos                   (16U)
#define CAN_RFC1_RFTS_Msk                   (0xFFFFU << CAN_RFC1_RFTS_Pos)          /*!< 0xFFFF0000 */
#define CAN_RFC1_RFTS                       CAN_RFC1_RFTS_Msk                       /*!< Receive FIFO time stamp */

/******************  Bit definition for CAN_RFDTL1 register  ******************/
#define CAN_RFDTL1_RFDT0_Pos                (0U)
#define CAN_RFDTL1_RFDT0_Msk                (0xFFU << CAN_RFDTL1_RFDT0_Pos)         /*!< 0x000000FF */
#define CAN_RFDTL1_RFDT0                    CAN_RFDTL1_RFDT0_Msk                    /*!< Receive FIFO data byte 0 */
#define CAN_RFDTL1_RFDT1_Pos                (8U)
#define CAN_RFDTL1_RFDT1_Msk                (0xFFU << CAN_RFDTL1_RFDT1_Pos)         /*!< 0x0000FF00 */
#define CAN_RFDTL1_RFDT1                    CAN_RFDTL1_RFDT1_Msk                    /*!< Receive FIFO data byte 1 */
#define CAN_RFDTL1_RFDT2_Pos                (16U)
#define CAN_RFDTL1_RFDT2_Msk                (0xFFU << CAN_RFDTL1_RFDT2_Pos)         /*!< 0x00FF0000 */
#define CAN_RFDTL1_RFDT2                    CAN_RFDTL1_RFDT2_Msk                    /*!< Receive FIFO data byte 2 */
#define CAN_RFDTL1_RFDT3_Pos                (24U)
#define CAN_RFDTL1_RFDT3_Msk                (0xFFU << CAN_RFDTL1_RFDT3_Pos)         /*!< 0xFF000000 */
#define CAN_RFDTL1_RFDT3                    CAN_RFDTL1_RFDT3_Msk                    /*!< Receive FIFO data byte 3 */

/******************  Bit definition for CAN_RFDTH1 register  ******************/
#define CAN_RFDTH1_RFDT4_Pos                (0U)
#define CAN_RFDTH1_RFDT4_Msk                (0xFFU << CAN_RFDTH1_RFDT4_Pos)         /*!< 0x000000FF */
#define CAN_RFDTH1_RFDT4                    CAN_RFDTH1_RFDT4_Msk                    /*!< Receive FIFO data byte 4 */
#define CAN_RFDTH1_RFDT5_Pos                (8U)
#define CAN_RFDTH1_RFDT5_Msk                (0xFFU << CAN_RFDTH1_RFDT5_Pos)         /*!< 0x0000FF00 */
#define CAN_RFDTH1_RFDT5                    CAN_RFDTH1_RFDT5_Msk                    /*!< Receive FIFO data byte 5 */
#define CAN_RFDTH1_RFDT6_Pos                (16U)
#define CAN_RFDTH1_RFDT6_Msk                (0xFFU << CAN_RFDTH1_RFDT6_Pos)         /*!< 0x00FF0000 */
#define CAN_RFDTH1_RFDT6                    CAN_RFDTH1_RFDT6_Msk                    /*!< Receive FIFO data byte 6 */
#define CAN_RFDTH1_RFDT7_Pos                (24U)
#define CAN_RFDTH1_RFDT7_Msk                (0xFFU << CAN_RFDTH1_RFDT7_Pos)         /*!< 0xFF000000 */
#define CAN_RFDTH1_RFDT7                    CAN_RFDTH1_RFDT7_Msk                    /*!< Receive FIFO data byte 7 */

/*!< CAN filter registers */
/******************  Bit definition for CAN_FCTRL register  *******************/
#define CAN_FCTRL_FCS_Pos                   (0U)
#define CAN_FCTRL_FCS_Msk                   (0x1U << CAN_FCTRL_FCS_Pos)             /*!< 0x00000001 */
#define CAN_FCTRL_FCS                       CAN_FCTRL_FCS_Msk                       /*!< Filter configuration switch */

/******************  Bit definition for CAN_FMCFG register  *******************/
#define CAN_FMCFG_FMSEL_Pos                 (0U)
#define CAN_FMCFG_FMSEL_Msk                 (0xFFFFFFFU << CAN_FMCFG_FMSEL_Pos)     /*!< 0x0FFFFFFF */
#define CAN_FMCFG_FMSEL                     CAN_FMCFG_FMSEL_Msk                     /*!< Filter mode select */
#define CAN_FMCFG_FMSEL0_Pos                (0U)
#define CAN_FMCFG_FMSEL0_Msk                (0x1U << CAN_FMCFG_FMSEL0_Pos)          /*!< 0x00000001 */
#define CAN_FMCFG_FMSEL0                    CAN_FMCFG_FMSEL0_Msk                    /*!< Filter mode select for filter 0 */
#define CAN_FMCFG_FMSEL1_Pos                (1U)
#define CAN_FMCFG_FMSEL1_Msk                (0x1U << CAN_FMCFG_FMSEL1_Pos)          /*!< 0x00000002 */
#define CAN_FMCFG_FMSEL1                    CAN_FMCFG_FMSEL1_Msk                    /*!< Filter mode select for filter 1 */
#define CAN_FMCFG_FMSEL2_Pos                (2U)
#define CAN_FMCFG_FMSEL2_Msk                (0x1U << CAN_FMCFG_FMSEL2_Pos)          /*!< 0x00000004 */
#define CAN_FMCFG_FMSEL2                    CAN_FMCFG_FMSEL2_Msk                    /*!< Filter mode select for filter 2 */
#define CAN_FMCFG_FMSEL3_Pos                (3U)
#define CAN_FMCFG_FMSEL3_Msk                (0x1U << CAN_FMCFG_FMSEL3_Pos)          /*!< 0x00000008 */
#define CAN_FMCFG_FMSEL3                    CAN_FMCFG_FMSEL3_Msk                    /*!< Filter mode select for filter 3 */
#define CAN_FMCFG_FMSEL4_Pos                (4U)
#define CAN_FMCFG_FMSEL4_Msk                (0x1U << CAN_FMCFG_FMSEL4_Pos)          /*!< 0x00000010 */
#define CAN_FMCFG_FMSEL4                    CAN_FMCFG_FMSEL4_Msk                    /*!< Filter mode select for filter 4 */
#define CAN_FMCFG_FMSEL5_Pos                (5U)
#define CAN_FMCFG_FMSEL5_Msk                (0x1U << CAN_FMCFG_FMSEL5_Pos)          /*!< 0x00000020 */
#define CAN_FMCFG_FMSEL5                    CAN_FMCFG_FMSEL5_Msk                    /*!< Filter mode select for filter 5 */
#define CAN_FMCFG_FMSEL6_Pos                (6U)
#define CAN_FMCFG_FMSEL6_Msk                (0x1U << CAN_FMCFG_FMSEL6_Pos)          /*!< 0x00000040 */
#define CAN_FMCFG_FMSEL6                    CAN_FMCFG_FMSEL6_Msk                    /*!< Filter mode select for filter 6 */
#define CAN_FMCFG_FMSEL7_Pos                (7U)
#define CAN_FMCFG_FMSEL7_Msk                (0x1U << CAN_FMCFG_FMSEL7_Pos)          /*!< 0x00000080 */
#define CAN_FMCFG_FMSEL7                    CAN_FMCFG_FMSEL7_Msk                    /*!< Filter mode select for filter 7 */
#define CAN_FMCFG_FMSEL8_Pos                (8U)
#define CAN_FMCFG_FMSEL8_Msk                (0x1U << CAN_FMCFG_FMSEL8_Pos)          /*!< 0x00000100 */
#define CAN_FMCFG_FMSEL8                    CAN_FMCFG_FMSEL8_Msk                    /*!< Filter mode select for filter 8 */
#define CAN_FMCFG_FMSEL9_Pos                (9U)
#define CAN_FMCFG_FMSEL9_Msk                (0x1U << CAN_FMCFG_FMSEL9_Pos)          /*!< 0x00000200 */
#define CAN_FMCFG_FMSEL9                    CAN_FMCFG_FMSEL9_Msk                    /*!< Filter mode select for filter 9 */
#define CAN_FMCFG_FMSEL10_Pos               (10U)
#define CAN_FMCFG_FMSEL10_Msk               (0x1U << CAN_FMCFG_FMSEL10_Pos)         /*!< 0x00000400 */
#define CAN_FMCFG_FMSEL10                   CAN_FMCFG_FMSEL10_Msk                   /*!< Filter mode select for filter 10 */
#define CAN_FMCFG_FMSEL11_Pos               (11U)
#define CAN_FMCFG_FMSEL11_Msk               (0x1U << CAN_FMCFG_FMSEL11_Pos)         /*!< 0x00000800 */
#define CAN_FMCFG_FMSEL11                   CAN_FMCFG_FMSEL11_Msk                   /*!< Filter mode select for filter 11 */
#define CAN_FMCFG_FMSEL12_Pos               (12U)
#define CAN_FMCFG_FMSEL12_Msk               (0x1U << CAN_FMCFG_FMSEL12_Pos)         /*!< 0x00001000 */
#define CAN_FMCFG_FMSEL12                   CAN_FMCFG_FMSEL12_Msk                   /*!< Filter mode select for filter 12 */
#define CAN_FMCFG_FMSEL13_Pos               (13U)
#define CAN_FMCFG_FMSEL13_Msk               (0x1U << CAN_FMCFG_FMSEL13_Pos)         /*!< 0x00002000 */
#define CAN_FMCFG_FMSEL13                   CAN_FMCFG_FMSEL13_Msk                   /*!< Filter mode select for filter 13 */
#define CAN_FMCFG_FMSEL14_Pos               (14U)
#define CAN_FMCFG_FMSEL14_Msk               (0x1U << CAN_FMCFG_FMSEL14_Pos)         /*!< 0x00004000 */
#define CAN_FMCFG_FMSEL14                   CAN_FMCFG_FMSEL14_Msk                   /*!< Filter mode select for filter 14 */
#define CAN_FMCFG_FMSEL15_Pos               (15U)
#define CAN_FMCFG_FMSEL15_Msk               (0x1U << CAN_FMCFG_FMSEL15_Pos)         /*!< 0x00008000 */
#define CAN_FMCFG_FMSEL15                   CAN_FMCFG_FMSEL15_Msk                   /*!< Filter mode select for filter 15 */
#define CAN_FMCFG_FMSEL16_Pos               (16U)
#define CAN_FMCFG_FMSEL16_Msk               (0x1U << CAN_FMCFG_FMSEL16_Pos)         /*!< 0x00010000 */
#define CAN_FMCFG_FMSEL16                   CAN_FMCFG_FMSEL16_Msk                   /*!< Filter mode select for filter 16 */
#define CAN_FMCFG_FMSEL17_Pos               (17U)
#define CAN_FMCFG_FMSEL17_Msk               (0x1U << CAN_FMCFG_FMSEL17_Pos)         /*!< 0x00020000 */
#define CAN_FMCFG_FMSEL17                   CAN_FMCFG_FMSEL17_Msk                   /*!< Filter mode select for filter 17 */
#define CAN_FMCFG_FMSEL18_Pos               (18U)
#define CAN_FMCFG_FMSEL18_Msk               (0x1U << CAN_FMCFG_FMSEL18_Pos)         /*!< 0x00040000 */
#define CAN_FMCFG_FMSEL18                   CAN_FMCFG_FMSEL18_Msk                   /*!< Filter mode select for filter 18 */
#define CAN_FMCFG_FMSEL19_Pos               (19U)
#define CAN_FMCFG_FMSEL19_Msk               (0x1U << CAN_FMCFG_FMSEL19_Pos)         /*!< 0x00080000 */
#define CAN_FMCFG_FMSEL19                   CAN_FMCFG_FMSEL19_Msk                   /*!< Filter mode select for filter 19 */
#define CAN_FMCFG_FMSEL20_Pos               (20U)
#define CAN_FMCFG_FMSEL20_Msk               (0x1U << CAN_FMCFG_FMSEL20_Pos)         /*!< 0x00100000 */
#define CAN_FMCFG_FMSEL20                   CAN_FMCFG_FMSEL20_Msk                   /*!< Filter mode select for filter 20 */
#define CAN_FMCFG_FMSEL21_Pos               (21U)
#define CAN_FMCFG_FMSEL21_Msk               (0x1U << CAN_FMCFG_FMSEL21_Pos)         /*!< 0x00200000 */
#define CAN_FMCFG_FMSEL21                   CAN_FMCFG_FMSEL21_Msk                   /*!< Filter mode select for filter 21 */
#define CAN_FMCFG_FMSEL22_Pos               (22U)
#define CAN_FMCFG_FMSEL22_Msk               (0x1U << CAN_FMCFG_FMSEL22_Pos)         /*!< 0x00400000 */
#define CAN_FMCFG_FMSEL22                   CAN_FMCFG_FMSEL22_Msk                   /*!< Filter mode select for filter 22 */
#define CAN_FMCFG_FMSEL23_Pos               (23U)
#define CAN_FMCFG_FMSEL23_Msk               (0x1U << CAN_FMCFG_FMSEL23_Pos)         /*!< 0x00800000 */
#define CAN_FMCFG_FMSEL23                   CAN_FMCFG_FMSEL23_Msk                   /*!< Filter mode select for filter 23 */
#define CAN_FMCFG_FMSEL24_Pos               (24U)
#define CAN_FMCFG_FMSEL24_Msk               (0x1U << CAN_FMCFG_FMSEL24_Pos)         /*!< 0x01000000 */
#define CAN_FMCFG_FMSEL24                   CAN_FMCFG_FMSEL24_Msk                   /*!< Filter mode select for filter 24 */
#define CAN_FMCFG_FMSEL25_Pos               (25U)
#define CAN_FMCFG_FMSEL25_Msk               (0x1U << CAN_FMCFG_FMSEL25_Pos)         /*!< 0x02000000 */
#define CAN_FMCFG_FMSEL25                   CAN_FMCFG_FMSEL25_Msk                   /*!< Filter mode select for filter 25 */
#define CAN_FMCFG_FMSEL26_Pos               (26U)
#define CAN_FMCFG_FMSEL26_Msk               (0x1U << CAN_FMCFG_FMSEL26_Pos)         /*!< 0x04000000 */
#define CAN_FMCFG_FMSEL26                   CAN_FMCFG_FMSEL26_Msk                   /*!< Filter mode select for filter 26 */
#define CAN_FMCFG_FMSEL27_Pos               (27U)
#define CAN_FMCFG_FMSEL27_Msk               (0x1U << CAN_FMCFG_FMSEL27_Pos)         /*!< 0x08000000 */
#define CAN_FMCFG_FMSEL27                   CAN_FMCFG_FMSEL27_Msk                   /*!< Filter mode select for filter 27 */

/******************  Bit definition for CAN_FBWCFG register  ******************/
#define CAN_FBWCFG_FBWSEL_Pos               (0U)
#define CAN_FBWCFG_FBWSEL_Msk               (0xFFFFFFFU << CAN_FBWCFG_FBWSEL_Pos)   /*!< 0x0FFFFFFF */
#define CAN_FBWCFG_FBWSEL                   CAN_FBWCFG_FBWSEL_Msk                   /*!< Filter bit width select */
#define CAN_FBWCFG_FBWSEL0_Pos              (0U)
#define CAN_FBWCFG_FBWSEL0_Msk              (0x1U << CAN_FBWCFG_FBWSEL0_Pos)        /*!< 0x00000001 */
#define CAN_FBWCFG_FBWSEL0                  CAN_FBWCFG_FBWSEL0_Msk                  /*!< Filter bit width select for filter 0 */
#define CAN_FBWCFG_FBWSEL1_Pos              (1U)
#define CAN_FBWCFG_FBWSEL1_Msk              (0x1U << CAN_FBWCFG_FBWSEL1_Pos)        /*!< 0x00000002 */
#define CAN_FBWCFG_FBWSEL1                  CAN_FBWCFG_FBWSEL1_Msk                  /*!< Filter bit width select for filter 1 */
#define CAN_FBWCFG_FBWSEL2_Pos              (2U)
#define CAN_FBWCFG_FBWSEL2_Msk              (0x1U << CAN_FBWCFG_FBWSEL2_Pos)        /*!< 0x00000004 */
#define CAN_FBWCFG_FBWSEL2                  CAN_FBWCFG_FBWSEL2_Msk                  /*!< Filter bit width select for filter 2 */
#define CAN_FBWCFG_FBWSEL3_Pos              (3U)
#define CAN_FBWCFG_FBWSEL3_Msk              (0x1U << CAN_FBWCFG_FBWSEL3_Pos)        /*!< 0x00000008 */
#define CAN_FBWCFG_FBWSEL3                  CAN_FBWCFG_FBWSEL3_Msk                  /*!< Filter bit width select for filter 3 */
#define CAN_FBWCFG_FBWSEL4_Pos              (4U)
#define CAN_FBWCFG_FBWSEL4_Msk              (0x1U << CAN_FBWCFG_FBWSEL4_Pos)        /*!< 0x00000010 */
#define CAN_FBWCFG_FBWSEL4                  CAN_FBWCFG_FBWSEL4_Msk                  /*!< Filter bit width select for filter 4 */
#define CAN_FBWCFG_FBWSEL5_Pos              (5U)
#define CAN_FBWCFG_FBWSEL5_Msk              (0x1U << CAN_FBWCFG_FBWSEL5_Pos)        /*!< 0x00000020 */
#define CAN_FBWCFG_FBWSEL5                  CAN_FBWCFG_FBWSEL5_Msk                  /*!< Filter bit width select for filter 5 */
#define CAN_FBWCFG_FBWSEL6_Pos              (6U)
#define CAN_FBWCFG_FBWSEL6_Msk              (0x1U << CAN_FBWCFG_FBWSEL6_Pos)        /*!< 0x00000040 */
#define CAN_FBWCFG_FBWSEL6                  CAN_FBWCFG_FBWSEL6_Msk                  /*!< Filter bit width select for filter 6 */
#define CAN_FBWCFG_FBWSEL7_Pos              (7U)
#define CAN_FBWCFG_FBWSEL7_Msk              (0x1U << CAN_FBWCFG_FBWSEL7_Pos)        /*!< 0x00000080 */
#define CAN_FBWCFG_FBWSEL7                  CAN_FBWCFG_FBWSEL7_Msk                  /*!< Filter bit width select for filter 7 */
#define CAN_FBWCFG_FBWSEL8_Pos              (8U)
#define CAN_FBWCFG_FBWSEL8_Msk              (0x1U << CAN_FBWCFG_FBWSEL8_Pos)        /*!< 0x00000100 */
#define CAN_FBWCFG_FBWSEL8                  CAN_FBWCFG_FBWSEL8_Msk                  /*!< Filter bit width select for filter 8 */
#define CAN_FBWCFG_FBWSEL9_Pos              (9U)
#define CAN_FBWCFG_FBWSEL9_Msk              (0x1U << CAN_FBWCFG_FBWSEL9_Pos)        /*!< 0x00000200 */
#define CAN_FBWCFG_FBWSEL9                  CAN_FBWCFG_FBWSEL9_Msk                  /*!< Filter bit width select for filter 9 */
#define CAN_FBWCFG_FBWSEL10_Pos             (10U)
#define CAN_FBWCFG_FBWSEL10_Msk             (0x1U << CAN_FBWCFG_FBWSEL10_Pos)       /*!< 0x00000400 */
#define CAN_FBWCFG_FBWSEL10                 CAN_FBWCFG_FBWSEL10_Msk                 /*!< Filter bit width select for filter 10 */
#define CAN_FBWCFG_FBWSEL11_Pos             (11U)
#define CAN_FBWCFG_FBWSEL11_Msk             (0x1U << CAN_FBWCFG_FBWSEL11_Pos)       /*!< 0x00000800 */
#define CAN_FBWCFG_FBWSEL11                 CAN_FBWCFG_FBWSEL11_Msk                 /*!< Filter bit width select for filter 11 */
#define CAN_FBWCFG_FBWSEL12_Pos             (12U)
#define CAN_FBWCFG_FBWSEL12_Msk             (0x1U << CAN_FBWCFG_FBWSEL12_Pos)       /*!< 0x00001000 */
#define CAN_FBWCFG_FBWSEL12                 CAN_FBWCFG_FBWSEL12_Msk                 /*!< Filter bit width select for filter 12 */
#define CAN_FBWCFG_FBWSEL13_Pos             (13U)
#define CAN_FBWCFG_FBWSEL13_Msk             (0x1U << CAN_FBWCFG_FBWSEL13_Pos)       /*!< 0x00002000 */
#define CAN_FBWCFG_FBWSEL13                 CAN_FBWCFG_FBWSEL13_Msk                 /*!< Filter bit width select for filter 13 */
#define CAN_FBWCFG_FBWSEL14_Pos             (14U)
#define CAN_FBWCFG_FBWSEL14_Msk             (0x1U << CAN_FBWCFG_FBWSEL14_Pos)       /*!< 0x00004000 */
#define CAN_FBWCFG_FBWSEL14                 CAN_FBWCFG_FBWSEL14_Msk                 /*!< Filter bit width select for filter 14 */
#define CAN_FBWCFG_FBWSEL15_Pos             (15U)
#define CAN_FBWCFG_FBWSEL15_Msk             (0x1U << CAN_FBWCFG_FBWSEL15_Pos)       /*!< 0x00008000 */
#define CAN_FBWCFG_FBWSEL15                 CAN_FBWCFG_FBWSEL15_Msk                 /*!< Filter bit width select for filter 15 */
#define CAN_FBWCFG_FBWSEL16_Pos             (16U)
#define CAN_FBWCFG_FBWSEL16_Msk             (0x1U << CAN_FBWCFG_FBWSEL16_Pos)       /*!< 0x00010000 */
#define CAN_FBWCFG_FBWSEL16                 CAN_FBWCFG_FBWSEL16_Msk                 /*!< Filter bit width select for filter 16 */
#define CAN_FBWCFG_FBWSEL17_Pos             (17U)
#define CAN_FBWCFG_FBWSEL17_Msk             (0x1U << CAN_FBWCFG_FBWSEL17_Pos)       /*!< 0x00020000 */
#define CAN_FBWCFG_FBWSEL17                 CAN_FBWCFG_FBWSEL17_Msk                 /*!< Filter bit width select for filter 17 */
#define CAN_FBWCFG_FBWSEL18_Pos             (18U)
#define CAN_FBWCFG_FBWSEL18_Msk             (0x1U << CAN_FBWCFG_FBWSEL18_Pos)       /*!< 0x00040000 */
#define CAN_FBWCFG_FBWSEL18                 CAN_FBWCFG_FBWSEL18_Msk                 /*!< Filter bit width select for filter 18 */
#define CAN_FBWCFG_FBWSEL19_Pos             (19U)
#define CAN_FBWCFG_FBWSEL19_Msk             (0x1U << CAN_FBWCFG_FBWSEL19_Pos)       /*!< 0x00080000 */
#define CAN_FBWCFG_FBWSEL19                 CAN_FBWCFG_FBWSEL19_Msk                 /*!< Filter bit width select for filter 19 */
#define CAN_FBWCFG_FBWSEL20_Pos             (20U)
#define CAN_FBWCFG_FBWSEL20_Msk             (0x1U << CAN_FBWCFG_FBWSEL20_Pos)       /*!< 0x00100000 */
#define CAN_FBWCFG_FBWSEL20                 CAN_FBWCFG_FBWSEL20_Msk                 /*!< Filter bit width select for filter 20 */
#define CAN_FBWCFG_FBWSEL21_Pos             (21U)
#define CAN_FBWCFG_FBWSEL21_Msk             (0x1U << CAN_FBWCFG_FBWSEL21_Pos)       /*!< 0x00200000 */
#define CAN_FBWCFG_FBWSEL21                 CAN_FBWCFG_FBWSEL21_Msk                 /*!< Filter bit width select for filter 21 */
#define CAN_FBWCFG_FBWSEL22_Pos             (22U)
#define CAN_FBWCFG_FBWSEL22_Msk             (0x1U << CAN_FBWCFG_FBWSEL22_Pos)       /*!< 0x00400000 */
#define CAN_FBWCFG_FBWSEL22                 CAN_FBWCFG_FBWSEL22_Msk                 /*!< Filter bit width select for filter 22 */
#define CAN_FBWCFG_FBWSEL23_Pos             (23U)
#define CAN_FBWCFG_FBWSEL23_Msk             (0x1U << CAN_FBWCFG_FBWSEL23_Pos)       /*!< 0x00800000 */
#define CAN_FBWCFG_FBWSEL23                 CAN_FBWCFG_FBWSEL23_Msk                 /*!< Filter bit width select for filter 23 */
#define CAN_FBWCFG_FBWSEL24_Pos             (24U)
#define CAN_FBWCFG_FBWSEL24_Msk             (0x1U << CAN_FBWCFG_FBWSEL24_Pos)       /*!< 0x01000000 */
#define CAN_FBWCFG_FBWSEL24                 CAN_FBWCFG_FBWSEL24_Msk                 /*!< Filter bit width select for filter 24 */
#define CAN_FBWCFG_FBWSEL25_Pos             (25U)
#define CAN_FBWCFG_FBWSEL25_Msk             (0x1U << CAN_FBWCFG_FBWSEL25_Pos)       /*!< 0x02000000 */
#define CAN_FBWCFG_FBWSEL25                 CAN_FBWCFG_FBWSEL25_Msk                 /*!< Filter bit width select for filter 25 */
#define CAN_FBWCFG_FBWSEL26_Pos             (26U)
#define CAN_FBWCFG_FBWSEL26_Msk             (0x1U << CAN_FBWCFG_FBWSEL26_Pos)       /*!< 0x04000000 */
#define CAN_FBWCFG_FBWSEL26                 CAN_FBWCFG_FBWSEL26_Msk                 /*!< Filter bit width select for filter 26 */
#define CAN_FBWCFG_FBWSEL27_Pos             (27U)
#define CAN_FBWCFG_FBWSEL27_Msk             (0x1U << CAN_FBWCFG_FBWSEL27_Pos)       /*!< 0x08000000 */
#define CAN_FBWCFG_FBWSEL27                 CAN_FBWCFG_FBWSEL27_Msk                 /*!< Filter bit width select for filter 27 */

